/* 
===============
!!!!! 加總 !!!!!
===============
*/

let num1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

let sum = 0;

num1.forEach(function (item) {
  sum += item;
  // console.log(sum);
});

// console.log(sum);

/* 
===============
!!!!! 偶數 !!!!!
===============
*/

let num2 = [30, 40, 100, 33333, 555596];

let oddArr = [];
num2.forEach(function (item) {
  if (item % 2 === 0) {
    oddArr.push(item);
  }
});

// console.log(oddArr);
// console.log(oddArr.length);

/* 
===================
!!!!! 存取物件 !!!!!
===================
*/

let objArr = [
  {
    name: "Tom",
    age: 45,
  },
  {
    name: "Mary",
    age: 30,
  },
];

objArr.forEach(function (item) {
  // console.log(item.name);
  // console.log(item.age);
});

/* 
====================
!!!!! 男女生數量 !!!!!
====================
*/

let genderData = [
  {
    name: "Tom",
    gender: "man",
  },
  {
    name: "Mary",
    gender: "woman",
  },
  {
    name: "Joe",
    gender: "man",
  },
  {
    name: "Tiffany",
    gender: "woman",
  },
  {
    name: "Jane",
    gender: "woman",
  },
];

let manNum = 0;
let womanNum = 0;

genderData.forEach(function (item) {
  if (item.gender === "man") {
    manNum++;
  } else {
    womanNum++;
  }
});

// console.log(manNum, womanNum);

/* 
=============================
!!!!! 電動充電站免費、投幣 !!!!!
=============================
*/

let chargeStations = [
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "新興區公所 ",
    Address: " 高雄市新興區中正三路34號1樓(室內停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄市民權停車場(機車停車場) ",
    Address: " 高雄市新興區民權一路221號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "為鑫機車行 ",
    Address: " 高雄市新興區民族二路126號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "億昌機車行 ",
    Address: " 高雄市新興區文昌里16鄰和平一路269號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "紫銧電動車(加盟店) ",
    Address: " 高雄市新興區開封路124-1號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄市立大同醫院 ",
    Address: " 高雄市前金區中華三路68號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "練習曲單車精品館(聯宏電動車) ",
    Address: " 高雄市前金區成功一路311號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "阮綜合醫院 ",
    Address: " 高雄市苓雅區成功一路162號(SPA館機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄市立凱旋醫院 ",
    Address: " 高雄市苓雅區凱旋二路130號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "特力屋大順店 ",
    Address: " 高雄市苓雅區武廟路218號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "紫銧電動車總店 ",
    Address: " 高雄市苓雅區武廟路131號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "家樂福購物中心-愛河店 ",
    Address: " 高雄市三民區河東路356號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "大樂股份有限公司 ",
    Address: " 高雄市三民區民族一路463號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄高級中學 ",
    Address: " 高雄市三民區建國三路50號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "育英醫護管理專科學校 ",
    Address: " 高雄市三民區大昌二路420巷15號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "躍揚車業行 ",
    Address: " 高雄市三民區熱河二街20號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "勝翔電動車 ",
    Address: " 高雄市三民區民族一路35號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "湖立方大樓 ",
    Address: " 高雄市三民區文揚路95號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "百達翡翠大樓 ",
    Address: " 高雄市三民區建興路419巷1號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "百達翡翠大樓 ",
    Address: " 高雄市三民區建興路419巷15號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "百達翡翠大樓 ",
    Address: " 高雄市三民區建興路419巷21號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "當代五合院大樓 ",
    Address: " 高雄市三民區建元路9巷7號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "京城世界二期大廈 ",
    Address: " 高雄市三民區裕誠路62號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "弘揚大第 ",
    Address: " 高雄市三民區民族一路543巷25號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "私立高苑科技大學 ",
    Address: " 高雄市路竹區中山路1821號(圖資大樓旁機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "竹輪車業行 ",
    Address: " 高雄市路竹區中正路3號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "經濟部加工出口區管理處環保站 ",
    Address:
      " 高雄市楠梓區楠梓加工區經一路50號(東七街與經一路口)環境保護站清潔隊",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "國立高雄第一科技大學 ",
    Address: " 高雄市楠梓區卓越路2號(第四機車停車場D區)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "輕鬆騎電能車 ",
    Address: " 高雄市楠梓區軍校路751之5號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "翠屏里活動中心 ",
    Address: " 高雄市楠梓區德惠路55號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "仁昌里活動中心 ",
    Address: " 高雄市楠梓區壽豐路461號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "居悅大樓 ",
    Address: " 高雄市楠梓區藍昌路360巷56號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "佛羅里達大樓 ",
    Address: " 高雄市楠梓區德民路22號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "加昌一期大樓 ",
    Address: " 高雄市楠梓區秀群路521號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "交響苑大樓 ",
    Address: " 高雄市楠梓區楠裕街28號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "私立東方技術學院 ",
    Address: " 高雄市湖內區中山路一段301巷61號(數位教學大樓前機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄市立空中大學 ",
    Address: " 高雄市小港區大業北路436號(校門外側圍牆)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "南區資源回收廠 ",
    Address: " 高雄市小港區北林路6號(游泳池旁停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "小港高級中學 ",
    Address: " 高雄市小港區學府路117號(地下停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄市立小港醫院 ",
    Address: " 高雄市小港區山明路482號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高鳳工家職業學校 ",
    Address: " 高雄市小港區松崗路119號(汽車科實習大樓)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "力王電動車業 ",
    Address: " 高雄市小港區沿海一路15號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "特力屋鳳山店 ",
    Address: " 高雄市鳳山區老爺里瑞隆東路99號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "鳳山高級商工職業學校 ",
    Address: " 高雄市鳳山區文衡路51號(圖書館旁機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "必翔電動車行 ",
    Address: " 高雄市鳳山區經武路63號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "老爺里活動中心 ",
    Address: " 高雄市鳳山區興隆街42號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "隆升機車行 ",
    Address: " 高雄市鳳山區文化西路162號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "青年市一期 ",
    Address: " 高雄市鳳山區文中街260巷1號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "緯城大三園大樓 ",
    Address: " 高雄市鳳山區杭州西街108號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "陽光西班牙大樓 ",
    Address: " 高雄市鳳山區和德街59號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "陽光西班牙大樓 ",
    Address: " 高雄市鳳山區和德街31號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "茄萣區公所 ",
    Address: " 高雄市茄萣區濱海路四段27號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "左營高中 ",
    Address: " 高雄市左營區 81344 海功路55號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "漢神巨蛋購物廣場 ",
    Address: " 高雄市左營區博愛二路777號(MB1E區機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "國軍左營醫院 ",
    Address: " 高雄市左營區軍校路553號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "京城之星大樓 ",
    Address: " 高雄市左營區明華一路283號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "京城之星大樓 ",
    Address: " 高雄市左營區明華一路275號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "喜悅大樓 ",
    Address: " 高雄市左營區文學路675號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "喜悅大樓 ",
    Address: " 高雄市左營區文學路681號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "文川大廈 ",
    Address: " 高雄市左營區文川路46號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "快樂弘揚大樓 ",
    Address: " 高雄市左營區重仁路251號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "本然大樓 ",
    Address: " 高雄市鼓山區南屏路561號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "私立樹德科技大學 ",
    Address: " 高雄市燕巢區橫山路59號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "私立義守大學(燕巢校區) ",
    Address: " 高雄市燕巢區角宿里義大路8號 (地下一樓機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "私立和春技術學院 ",
    Address: " 高雄市大寮區琉球村農場路1-10號(守衛室旁)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "中山高級工商職業學校 ",
    Address: " 高雄市大寮區正氣路79號(大門右側一樓停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "旭冬車業 ",
    Address: " 高雄市大寮區鳳林三路205號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "好市多購物中心 ",
    Address: " 高雄市鼓山區大順一路111號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "國立中山大學 ",
    Address: " 高雄市鼓山區蓮海路70號(海科館停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "大榮高級中學 ",
    Address: " 高雄市鼓山區大榮街1號(警衛室後方機車停車棚)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "中山大學 ",
    Address: " 高雄市鼓山區蓮海路70號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "美河峰大樓 ",
    Address: " 高雄市鼓山區美術南二路12號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "橘園大樓 ",
    Address: " 高雄市鼓山區美術東八街101號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "米羅大廈 ",
    Address: " 高雄市鼓山區美術東八街82號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "米羅大廈 ",
    Address: " 高雄市鼓山區美術東八街100號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "皇苑人文首馥大樓 ",
    Address: " 高雄市鼓山區神農路199號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "采荷天大樓 ",
    Address: " 高雄市鼓山區文忠路57號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "仁武煙度檢測站 ",
    Address: " 高雄市仁武區仁安二巷102號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "力達車業-橋頭店 ",
    Address: " 高雄市橋頭區橋頭路5號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "私立正修科技大學 ",
    Address: " 高雄市鳥松區澄清路840號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄市政府環保局澄清辦公室 ",
    Address: " 高雄市鳥松區澄清路834號(機車停車棚)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "仁美里活動中心 ",
    Address: " 高雄市鳥松區美山路228號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "鳥松區公所 ",
    Address: " 高雄市鳥松區中正路98號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "澄峰大廈 ",
    Address: " 高雄市鳥松區明湖路1號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "好市多購物中心-中華店 ",
    Address: " 高雄市前鎮區中華五路656號(機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "統一夢時代購物中心 ",
    Address: " 高雄市前鎮區中華五路789號(B1M C07區 機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "瑞祥高級中學 ",
    Address: " 高雄市前鎮區班超路63號(警衛室後方機車停車棚)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "躍揚車業行三多分店 ",
    Address: " 高雄市前鎮區三多二路367號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "駿揚電動車 ",
    Address: " 高雄市前鎮區武營路195號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "本欣電動車 ",
    Address: " 高雄市前鎮區崗山西街279號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "前鎮區公所 ",
    Address: " 高雄市前鎮區康定路151號2樓",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "美的皇家大樓 ",
    Address: " 高雄市前鎮區林森三路156號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "太普moma大樓 ",
    Address: " 高雄市前鎮區管仲南路362號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "勝翔車業 ",
    Address: " 高雄市岡山區岡山路192號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "義贊電動車 ",
    Address: " 高雄市岡山區岡山路208號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "私立義守大學(校本部) ",
    Address: " 高雄市大樹區學城路一段1號(汽車停車場警衛室旁)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "耿昌機車行 ",
    Address: " 高雄市新興區青年一路458號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "亨旺機車行-(公共免費)",
    Address: "高雄市三民區大豐二路362號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "富翔機車有限公司(原富鼎)",
    Address: " 高雄市前鎮區瑞祥街138號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "京城CBD大樓",
    Address: "高雄市中華一路820號(地下停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "大東藝術中心",
    Address: "高雄市鳳山區光遠路161號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "鎮北里活動中心",
    Address: "高雄市鳳山區鎮北街102號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "緯城世界觀大樓",
    Address: "高雄市鳳山區西湖街107號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "東方瑞士大樓",
    Address: "高雄市三民區大豐一路111-3號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "岡山鐵馬",
    Address: "高雄市岡山區平和路31號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "竺輪車業",
    Address: "高雄市岡山區中山北路 98號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "三元機車行",
    Address: "高雄市大寮區義和村鳳屏二路294號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "高雄師範大學",
    Address: "高雄市苓雅區和平一路116號  (面對大門左手邊機車停車場)",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "信華車業行",
    Address: "高雄市楠梓區益群路26號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "義興機車行",
    Address: "高雄市三民區瀋陽街122號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "國順機車行",
    Address: "高雄市三民區興隆街42-1號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "順士輪業有限公司",
    Address: "高雄市新興區林森一路27號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "誠峰輪業有限公司",
    Address: "高雄市新興區和平一路263號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "明光機車行",
    Address: "高雄市鼓山區鼓山三路8-24號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "富貴祥發大樓",
    Address: "高雄市鳳山區文衡路 269號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "南成機車行",
    Address: "高雄市苓雅區福安路467號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "單車休息站",
    Address: "高雄市鹽埕區七賢三路1號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "登山里里長服務處",
    Address: "高雄市鼓山區鼓山一路87號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "永盛花園廣場大樓",
    Address: "高雄市岡山區竹圍東街203-1號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "全陽機車行",
    Address: "高雄市三民區明誠一路372號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "東晉機車行",
    Address: "高雄市新興區民族二路64號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "先發機車行",
    Address: "高雄市苓雅區英明路273號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "高雄師範大學",
    Address: "高雄市苓雅區和平一路116號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "高雄師範大學",
    Address: "高雄市苓雅區和平一路116號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "甲駿機車材料行",
    Address: "高雄市前鎮區瑞和街220號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "上揚機車行",
    Address: "高雄市楠梓區常德路273號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "竹輪車業",
    Address: "高雄市楠梓區加昌路343號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "高雄師範大學",
    Address: "高雄市燕巢區深中路62號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "高雄女子高級中學(不對外開放) ",
    Address: "高雄市前金區五福三路122號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "高雄女子高級中學(不對外開放) ",
    Address: "高雄市前金區五福三路122號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "高雄師範大學",
    Address: "高雄市燕巢區深中路62號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "泛亞車業",
    Address: "高雄市鼓山區華榮路585號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "湖山春曉社區",
    Address: "高雄市鳳山區八德路二段147號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "新大機車行",
    Address: "高雄市三民區鼎中路52號",
  },
  {
    Kind: "公共充電站",
    Charge: "免費",
    Location: "高雄第一科技大學",
    Address: "高雄市楠梓區卓越路2號",
  },
  {
    Kind: "公共充電站",
    Charge: "投幣式",
    Location: "皇苑逸品苑",
    Address: "高雄市鼓山區美術北三路100號",
  },
];

// console.log(chargeStations);

let charge = {
  coin: 0,
  free: 0,
};

chargeStations.forEach(function (item) {
  if (item.Charge === "免費") {
    charge.free++;
  } else {
    charge.coin++;
  }
});

// console.log(charge);

/* 
========================
!!!!! 電動充電站篩選 !!!!!
========================
*/

let filterData = {
  free: [],
  coin: [],
};

chargeStations.forEach(function (item) {
  if (item.Charge === "免費") {
    filterData.free.push(item);
  } else {
    filterData.coin.push(item);
  }
});

// console.log(filterData);

/* 
===========================
!!!!! 新增資料、資料顯示 !!!!!
===========================
*/

/* 
====================================================
1.預設資料顯示在網頁。
2.點擊按鈕後，取得輸入資料、取得選單資料，並建立物件儲存資料。
3.並解將物件推入空陣列中。
4.將陣列資料依全部、免費、投幣式的分類，顯示在頁面。
====================================================
*/

/* 
=======
取得節點
=======
*/

// 取得名稱輸入欄位
let chargingName = document.querySelector(".chargingName");
console.log(chargingName);
console.dir(chargingName);

// 取得付款方式輸入欄位
let chargingPay = document.querySelector(".chargingPay");
console.log(chargingPay);
console.dir(chargingPay);

// 取得儲存按鈕
let chargingStorage = document.querySelector(".chargingStorage");
console.log(chargingStorage);
console.dir(chargingStorage);

// 取得清單
let showcharging = document.querySelector(".showcharging");
console.log(showcharging);
console.dir(showcharging);

// 取得全部按鈕
let showAllBtn = document.querySelector(".showAllBtn");
console.log(showAllBtn);
console.dir(showAllBtn);

// 取得免費按鈕
let showFreeBtn = document.querySelector(".showFreeBtn");
console.log(showFreeBtn);
console.dir(showFreeBtn);

// 取得投幣式按鈕
let showCoinBtn = document.querySelector(".showCoinBtn");
console.log(showCoinBtn);
console.dir(showCoinBtn);

// 取得刪除最後一筆資料按鈕
let deleteOneBtn = document.querySelector(".deleteOneBtn");
console.log(deleteOneBtn);
console.dir(deleteOneBtn);

/* 
=================
儲存即時輸入欄位資料
=================
*/
let chargingNameValue = chargingName.value;
let chargingPayValue = chargingPay.value;

/* 
========
宣告空陣列
========
*/
let chargingArr = [
  {
    pay: "免費",
    name: "廖洧杰充電站",
  },
  {
    pay: "投幣式",
    name: "小花充電站",
  },
  {
    pay: "投幣式",
    name: "小明充電站",
  },
  {
    pay: "投幣式",
    name: "小天充電站",
  },
];

/* 
=======================
宣告取得即時輸入欄位資料函式
=======================
*/

function getChargingValue() {
  // 清空名稱輸入欄位即時資料
  chargingNameValue = chargingName.value;
  console.log(chargingNameValue);

  // 清空付款方式輸入欄位即時資料
  chargingPayValue = chargingPay.value;
  console.log(chargingPayValue);
}

/* 
=======================
宣告清空即時輸入欄位資料函式
=======================
*/

function clearChargingValue() {
  // 取得名稱輸入欄位即時資料
  chargingName.value = "";

  // 取得付款方式輸入欄位即時資料
  chargingPay.value = "免費";
}

/* 
====================
將預設資料，顯示在頁面上
====================
*/

/*
!!!!!  這種寫法會一直在更新 DOM，老師的寫法是先把字串處理好，儲存在一個字串內，然後再一次性更新 DOM。 !!!!!
*/

/*
!!!!! 這裡其實就是初始化頁面  !!!!!
*/

function showDefaultData() {
  chargingArr.forEach(function (item) {
    showcharging.innerHTML += `<li>${item.name}充電站，${item.pay}。</li>`;
  });
}
showDefaultData();

/* 
=================
宣告顯示全部資料函式
=================
*/

/*
!!!!!  這種寫法會一直在更新 DOM，老師的寫法是先把字串處理好，儲存在一個字串內，然後再一次性更新 DOM。 !!!!!
*/

function showAllcharging() {
  // 在清單，顯示全部資料
  showcharging.innerHTML = "";
  chargingArr.forEach(function (item) {
    showcharging.innerHTML += `<li>${item.name}充電站，${item.pay}。</li>`;
  });
}

/* 
=====================================================
取得即時輸入資料、建立物件儲存資料、資料新增至陣列、顯示全部資料
=====================================================
*/

chargingStorage.addEventListener("click", function () {
  // 呼叫取得即時輸入欄位資料函式
  getChargingValue();

  // 宣告、建立物件
  let chargingObj = {
    name: chargingNameValue,
    pay: chargingPayValue,
  };

  // 建立陣列資料
  chargingArr.push(chargingObj);
  console.log(chargingArr);
  showAllcharging();
  clearChargingValue();
});

/* 
==================
篩選後，在頁面顯示資料
==================
*/

/*
!!!!!  
1.我的寫法是個別按鈕去綁監聽，但其實可以使用父層綁監聽的方式。
2.使用 e.target.value 、forEach 的 item，來判斷點擊位置。
3.innerHTML 寫法會一直在更新 DOM，老師的寫法是先把字串處理好，儲存在一個字串內，然後再一次性更新 DOM。


!!!!!
*/

// 在清單，顯示全部資料
showAllBtn.addEventListener("click", function () {
  showcharging.innerHTML = "";
  chargingArr.forEach(function (item) {
    showcharging.innerHTML += `<li>${item.name}充電站，${item.pay}。</li>`;
  });
});

// 在清單，顯示免費資料
let showFreeArr = [];

showFreeBtn.addEventListener("click", function (e) {
  showFreeArr = [];

  chargingArr.forEach(function (item) {
    if (item.pay === e.target.value) {
      showFreeArr.push(item);
    }
    console.log(`我是showFreeArr`);
    console.log(showFreeArr);

    showcharging.innerHTML = "";
    showFreeArr.forEach(function (item) {
      showcharging.innerHTML += `<li>${item.name}充電站，${item.pay}。</li>`;
    });
  });
});

// 在清單，顯示投幣式資料
let showCoinArr = [];

showCoinBtn.addEventListener("click", function (e) {
  showCoinArr = [];

  chargingArr.forEach(function (item) {
    if (item.pay === e.target.value) {
      showCoinArr.push(item);
    }
    console.log(`我是showCoinArr`);
    console.log(showCoinArr);

    showcharging.innerHTML = "";
    showCoinArr.forEach(function (item) {
      showcharging.innerHTML += `<li>${item.name}充電站，${item.pay}。</li>`;
    });
  });
});

/* 
=============
刪除最後一筆資料
=============
*/

deleteOneBtn.addEventListener("click", function () {
  chargingArr.pop();
  showAllcharging();
});

/*
====================
!!!!! 國中生人數 !!!!!
====================
*/

let junior = [
  { school: "復興國中", num: 3013 },
  { school: "後甲國中", num: 2050 },
  { school: "民德國中", num: 1817 },
  { school: "建興國中", num: 1680 },
  { school: "崇明國中", num: 1544 },
];

let juniorNum = 0;

junior.forEach(function (item) {
  juniorNum += item.num;
});

console.log(juniorNum);

let chief = [
  {
    區別: "鹽埕區",
    里別: "藍橋里",
    里長姓名: "陳本興",
    性別: "男",
    生日: "0380817",
    辦公室電話: "075219559",
    住家電話: "075219559",
    手機: "0921236319",
    信箱: "kh01001@kcg.gov.tw",
    辦公室: "鹽埕區藍橋里建國四路344號1樓",
    黨籍: "其他",
    經歷: "改制後第3.4屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "慈愛里",
    里長姓名: "呂南風",
    性別: "男",
    生日: "0480219",
    辦公室電話: "075611540",
    住家電話: "075611540",
    手機: "0936430430",
    信箱: "kh01002@kcg.gov.tw",
    辦公室: "鹽埕區慈愛里９鄰北端街３０號",
    黨籍: "無黨籍",
    經歷: "新任里長",
  },
  {
    區別: "鹽埕區",
    里別: "博愛里",
    里長姓名: "林哲弘",
    性別: "男",
    生日: "0660204",
    辦公室電話: "075335206",
    住家電話: "",
    手機: "0986021877",
    信箱: "kh01003@kcg.gov.tw",
    辦公室: "鹽埕區博愛里北端街7巷76號",
    黨籍: "民主進步黨",
    經歷: "合併後第2屆",
  },
  {
    區別: "鹽埕區",
    里別: "壽星里",
    里長姓名: "黃強",
    性別: "男",
    生日: "0470902",
    辦公室電話: "075519889",
    住家電話: "075616245",
    手機: "0932761727",
    信箱: "kh01004@kcg.gov.tw",
    辦公室: "鹽埕區壽星里七賢三路225號",
    黨籍: "無黨籍",
    經歷: "改制後第5~7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "中山里",
    里長姓名: "易明忠",
    性別: "男",
    生日: "0550414",
    辦公室電話: "075517334",
    住家電話: "075617226",
    手機: "0952665502",
    信箱: "kh01005@kcg.gov.tw",
    辦公室: "中山里七賢三路161號",
    黨籍: "無黨籍",
    經歷: "合併後第2屆",
  },
  {
    區別: "鹽埕區",
    里別: "教仁里",
    里長姓名: "高陳文玲",
    性別: "女",
    生日: "0490606",
    辦公室電話: "0921238867",
    住家電話: "不顯示",
    手機: "0921238867",
    信箱: "kh01006@kcg.gov.tw",
    辦公室: "鹽埕區教仁里新樂街259號",
    黨籍: "無黨籍",
    經歷: "合併後第2屆",
  },
  {
    區別: "鹽埕區",
    里別: "新樂里",
    里長姓名: "廖明烈",
    性別: "男",
    生日: "0490424",
    辦公室電話: "075518772",
    住家電話: "",
    手機: "0935071593",
    信箱: "kh01007@kcg.gov.tw",
    辦公室: "新樂里大勇路65號4樓",
    黨籍: "民主進步黨",
    經歷: "新任里長",
  },
  {
    區別: "鹽埕區",
    里別: "中原里",
    里長姓名: "蔡崇銘",
    性別: "男",
    生日: "0511023",
    辦公室電話: "075310209",
    住家電話: "075310209",
    手機: "0955191699",
    信箱: "kh01008@kcg.gov.tw",
    辦公室: "鹽埕區中原里大仁路159號",
    黨籍: "民主進步黨",
    經歷: "改制後第7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "光明里",
    里長姓名: "葛吉雄",
    性別: "男",
    生日: "0500924",
    辦公室電話: "075510137",
    住家電話: "075510137",
    手機: "0952633619",
    信箱: "kh01009@kcg.gov.tw",
    辦公室: "鹽埕區光明里光榮街79號",
    黨籍: "無黨籍",
    經歷: "改制後第5~7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "育仁里",
    里長姓名: "葛有力",
    性別: "男",
    生日: "0530603",
    辦公室電話: "075326505",
    住家電話: "075326505",
    手機: "0910788822",
    信箱: "kh01010@kcg.gov.tw",
    辦公室: "鹽埕區育仁里大成街70號",
    黨籍: "無黨籍",
    經歷: "改制後第6.7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "河濱里",
    里長姓名: "林德松",
    性別: "男",
    生日: "0441006",
    辦公室電話: "075333318",
    住家電話: "075333318",
    手機: "0952335585",
    信箱: "kh01011@kcg.gov.tw",
    辦公室: "鹽埕區河濱里莒光街83號",
    黨籍: "無黨籍",
    經歷: "改制後第6.7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "沙地里",
    里長姓名: "蔡鎮興",
    性別: "男",
    生日: "0430721",
    辦公室電話: "075613488",
    住家電話: "075613488",
    手機: "0931722188",
    信箱: "kh01012@kcg.gov.tw",
    辦公室: "鹽埕區沙地里必忠街16號",
    黨籍: "無黨籍",
    經歷: "改制後第3~7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "南端里",
    里長姓名: "陳清標",
    性別: "男",
    生日: "0400114",
    辦公室電話: "075611591",
    住家電話: "",
    手機: "0988313907",
    信箱: "kh01013@kcg.gov.tw",
    辦公室: "鹽埕區南端里必忠街106號",
    黨籍: "無黨籍",
    經歷: "改制後第7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "港都里",
    里長姓名: "邱誌雲",
    性別: "男",
    生日: "0510828",
    辦公室電話: "075618518",
    住家電話: "075617968",
    手機: "0912057518",
    信箱: "kh01014@kcg.gov.tw",
    辦公室: "鹽埕區港都里五福四路239巷2之72號",
    黨籍: "民主進步黨",
    經歷: "合併後第2屆",
  },
  {
    區別: "鹽埕區",
    里別: "江西里",
    里長姓名: "鄭錫國",
    性別: "男",
    生日: "0450131",
    辦公室電話: "075515568",
    住家電話: "075615888",
    手機: "0931719211",
    信箱: "kh01015@kcg.gov.tw",
    辦公室: "鹽埕區江西里五福四路301巷4號",
    黨籍: "中國國民黨",
    經歷: "改制後第5~7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "新豐里",
    里長姓名: "蘇金發",
    性別: "男",
    生日: "0570624",
    辦公室電話: "075614501",
    住家電話: "",
    手機: "0953687099",
    信箱: "kh01016@kcg.gov.tw",
    辦公室: "鹽埕區新豐里建國四路40之1號",
    黨籍: "無黨籍",
    經歷: "改制後第7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "府北里",
    里長姓名: "林傳富",
    性別: "男",
    生日: "0530618",
    辦公室電話: "075513861",
    住家電話: "",
    手機: "0932993340",
    信箱: "kh01017@kcg.gov.tw",
    辦公室: "鹽埕區府北里大有街66號",
    黨籍: "民主進步黨",
    經歷: "合併後第2屆",
  },
  {
    區別: "鹽埕區",
    里別: "陸橋里",
    里長姓名: "許梅娟",
    性別: "女",
    生日: "0540521",
    辦公室電話: "075618888",
    住家電話: "075311158",
    手機: "0916035881",
    信箱: "kh01018@kcg.gov.tw",
    辦公室: "鹽埕區陸橋里田單街14號1樓",
    黨籍: "民主進步黨",
    經歷: "合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "瀨南里",
    里長姓名: "林森林",
    性別: "男",
    生日: "0300410",
    辦公室電話: "075514027",
    住家電話: "075514027",
    手機: "0932820457",
    信箱: "kh01019@kcg.gov.tw",
    辦公室: "鹽埕區瀨南里瀨南街184號",
    黨籍: "無黨籍",
    經歷: "改制後第6.7屆,合併後第1.2屆",
  },
  {
    區別: "鹽埕區",
    里別: "新化里",
    里長姓名: "夏麗鳳",
    性別: "女",
    生日: "0521225",
    辦公室電話: "075517382",
    住家電話: "",
    手機: "0927509157",
    信箱: "kh01020@kcg.gov.tw",
    辦公室: "鹽埕區新化里新化街67號2樓之2",
    黨籍: "無黨籍",
    經歷: "新任里長",
  },
  {
    區別: "鹽埕區",
    里別: "江南里",
    里長姓名: "蔡德龍",
    性別: "男",
    生日: "0560822",
    辦公室電話: "075617036",
    住家電話: "075617036",
    手機: "0975036278",
    信箱: "kh01021@kcg.gov.tw",
    辦公室: "鹽埕區江南里大勇路29巷14號",
    黨籍: "民主進步黨",
    經歷: "改制後第5~7屆,合併後第1.2屆",
  },
  {
    區別: "鼓山區",
    里別: "鼓峰里",
    里長姓名: "麥克士",
    性別: "男",
    生日: "0460205",
    辦公室電話: "075887230",
    住家電話: "075834282",
    手機: "0931721652",
    信箱: "kh02001@kcg.gov.tw",
    辦公室: "鼓山區鼓峰里九如四路2014巷4號5樓之1",
    黨籍: "中國國民黨",
    經歷: "改制後第5~7屆,合併後第1~2屆里長",
  },
  {
    區別: "鼓山區",
    里別: "雄峰里",
    里長姓名: "蘇柏銓",
    性別: "男",
    生日: "0750811",
    辦公室電話: "075886660",
    住家電話: "075886660",
    手機: "0938860690",
    信箱: "kh02002@kcg.gov.tw",
    辦公室: "鼓山區雄峰里雄峰路29號",
    黨籍: "中國國民黨",
    經歷: "新任里長",
  },
  {
    區別: "鼓山區",
    里別: "前峰里",
    里長姓名: "盧明惠",
    性別: "男",
    生日: "0450402",
    辦公室電話: "075836338",
    住家電話: "075834322",
    手機: "0928729592",
    信箱: "kh02003@kcg.gov.tw",
    辦公室: "鼓山區前峰里九如四路1339巷6號",
    黨籍: "中國國民黨",
    經歷: "改制後第2~7屆,合併後第1~2屆里長",
  },
  {
    區別: "鼓山區",
    里別: "光榮里",
    里長姓名: "許秀蕊",
    性別: "女",
    生日: "0510522",
    辦公室電話: "075887555",
    住家電話: "075828075",
    手機: "0930828088",
    信箱: "kh02004@kcg.gov.tw",
    辦公室: "鼓山區光榮里九如四路1460巷12號",
    黨籍: "無黨籍",
    經歷: "改制後第7屆,合併後第1~2屆里長",
  },
  {
    區別: "鼓山區",
    里別: "民族里",
    里長姓名: "朱春木",
    性別: "男",
    生日: "0460310",
    辦公室電話: "075825288",
    住家電話: "075825288",
    手機: "0932747701",
    信箱: "kh02005@kcg.gov.tw",
    辦公室: "鼓山區民族里葆禎路220號",
    黨籍: "中國國民黨",
    經歷: "改制後第6~7屆,合併後第1~2屆里長",
  },
  {
    區別: "鼓山區",
    里別: "內惟里",
    里長姓名: "林進發",
    性別: "男",
    生日: "0410422",
    辦公室電話: "075880231",
    住家電話: "075880231",
    手機: "0911159991",
    信箱: "kh02006@kcg.gov.tw",
    辦公室: "鼓山區內惟里吳鳳路87號",
    黨籍: "無黨籍",
    經歷: "合併後第1~2屆里長",
  },
  {
    區別: "鼓山區",
    里別: "建國里",
    里長姓名: "李仁宗",
    性別: "男",
    生日: "0401118",
    辦公室電話: "075833457",
    住家電話: "075833457",
    手機: "0915329709",
    信箱: "kh02007@kcg.gov.tw",
    辦公室: "鼓山區建榮路157巷24號",
    黨籍: "無黨籍",
    經歷: "改制後第3~7屆,合併後第1~2屆里長",
  },
  {
    區別: "鼓山區",
    里別: "忠正里",
    里長姓名: "洪吉祥",
    性別: "男",
    生日: "0320121",
    辦公室電話: "075210054",
    住家電話: "075327346",
    手機: "0910844846",
    信箱: "kh02008@kcg.gov.tw",
    辦公室: "鼓山區忠正里西藏街355號",
    黨籍: "中國國民黨",
    經歷: "改制前第11屆,改制後第1~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "自強里",
    里長姓名: "方紹義",
    性別: "男",
    生日: "0380603",
    辦公室電話: "075334711",
    住家電話: "075819596",
    手機: "0938193302",
    信箱: "kh02009@kcg.gov.tw",
    辦公室: "鼓山區自強里鼓山三路115巷4號",
    黨籍: "中國國民黨",
    經歷: "改制後第7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "龍井里",
    里長姓名: "周明吉",
    性別: "男",
    生日: "0420128",
    辦公室電話: "075619983",
    住家電話: "075619983",
    手機: "0910891171",
    信箱: "kh02010@kcg.gov.tw",
    辦公室: "高雄市鼓山區鼓山三路25巷37號附2",
    黨籍: "無黨籍",
    經歷: "新任里長",
  },
  {
    區別: "鼓山區",
    里別: "正德里",
    里長姓名: "朱榮俊",
    性別: "男",
    生日: "0461120",
    辦公室電話: "075338107",
    住家電話: "075329203",
    手機: "0936361659",
    信箱: "kh02011@kcg.gov.tw",
    辦公室: "鼓山區正德里青泉街13號",
    黨籍: "中國國民黨",
    經歷: "改制後第4~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "平和里",
    里長姓名: "陳玉芳",
    性別: "女",
    生日: "0440519",
    辦公室電話: "075219156",
    住家電話: "075218896",
    手機: "0912655151",
    信箱: "kh02012@kcg.gov.tw",
    辦公室: "鼓山區平和里九如四路711巷2弄10號",
    黨籍: "民主進步黨",
    經歷: "合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "民強里",
    里長姓名: "歐華美",
    性別: "女",
    生日: "0510407",
    辦公室電話: "075327785",
    住家電話: "075327785",
    手機: "0978597785",
    信箱: "kh02013@kcg.gov.tw",
    辦公室: "高雄市鼓山區金川街25號",
    黨籍: "中國國民黨",
    經歷: "新任里長",
  },
  {
    區別: "鼓山區",
    里別: "厚生里",
    里長姓名: "歐瑞清",
    性別: "男",
    生日: "0441113",
    辦公室電話: "075326167",
    住家電話: "075311812",
    手機: "0938376567",
    信箱: "kh02014@kcg.gov.tw",
    辦公室: "鼓山區厚生里九如四路602號",
    黨籍: "無黨籍",
    經歷: "合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "龍子里",
    里長姓名: "蘇彥傑",
    性別: "男",
    生日: "0680319",
    辦公室電話: "075554638",
    住家電話: "0937848776",
    手機: "0937848776",
    信箱: "kh02015@kcg.gov.tw",
    辦公室: "高雄市鼓山區中華一路2133巷47號",
    黨籍: "無黨籍",
    經歷: "新任里長",
  },
  {
    區別: "鼓山區",
    里別: "龍水里",
    里長姓名: "初學霖",
    性別: "男",
    生日: "0520624",
    辦公室電話: "",
    住家電話: "",
    手機: "0912341398",
    信箱: "kh02016@kcg.gov.tw",
    辦公室: "高雄市鼓山區美術北五街102號8樓",
    黨籍: "民主進步黨",
    經歷: "新任里長",
  },
  {
    區別: "鼓山區",
    里別: "明誠里",
    里長姓名: "胡景森",
    性別: "男",
    生日: "0470114",
    辦公室電話: "075557582",
    住家電話: "075535755",
    手機: "0932747202",
    信箱: "kh02017@kcg.gov.tw",
    辦公室: "鼓山區明誠里民利街72號",
    黨籍: "中國國民黨",
    經歷: "合併後第2屆",
  },
  {
    區別: "鼓山區",
    里別: "華豐里",
    里長姓名: "黃明洲",
    性別: "男",
    生日: "0460904",
    辦公室電話: "075535783",
    住家電話: "075521010",
    手機: "0911670170",
    信箱: "kh02018@kcg.gov.tw",
    辦公室: "鼓山區華豐里華榮路320號",
    黨籍: "中國國民黨",
    經歷: "改制後第3~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "裕興里",
    里長姓名: "曾榮發",
    性別: "男",
    生日: "0441031",
    辦公室電話: "075541917",
    住家電話: "075520806",
    手機: "0926036266",
    信箱: "kh02019@kcg.gov.tw",
    辦公室: "鼓山區裕興里裕興路3號",
    黨籍: "中國國民黨",
    經歷: "改制後第5~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "裕豐里",
    里長姓名: "周恆功",
    性別: "男",
    生日: "0370728",
    辦公室電話: "075522590",
    住家電話: "075522425",
    手機: "0929024221",
    信箱: "kh02020@kcg.gov.tw",
    辦公室: "鼓山區裕豐里裕豐街60號",
    黨籍: "中國國民黨",
    經歷: "改制後第7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "鼓岩里",
    里長姓名: "方國智",
    性別: "男",
    生日: "0410311",
    辦公室電話: "075617979",
    住家電話: "075617979",
    手機: "0919100684",
    信箱: "kh02021@kcg.gov.tw",
    辦公室: "鼓山區鼓岩里鼓山二路131巷12弄3號",
    黨籍: "無黨籍",
    經歷: "改制後第3~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "樹德里",
    里長姓名: "黃武田",
    性別: "男",
    生日: "0530310",
    辦公室電話: "075210257",
    住家電話: "075336215",
    手機: "0939354618",
    信箱: "kh02022@kcg.gov.tw",
    辦公室: "鼓山區樹德里鼓山二路222號",
    黨籍: "無黨籍",
    經歷: "改制後第7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "寶樹里",
    里長姓名: "王登科",
    性別: "男",
    生日: "0401102",
    辦公室電話: "075313675",
    住家電話: "075330893",
    手機: "0928729593",
    信箱: "kh02023@kcg.gov.tw",
    辦公室: "鼓山區寶樹里鼓山二路178巷5號",
    黨籍: "無黨籍",
    經歷: "合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "興宗里",
    里長姓名: "許嘉紘",
    性別: "女",
    生日: "0460517",
    辦公室電話: "075320065",
    住家電話: "075320065",
    手機: "0970800001",
    信箱: "kh02024@kcg.gov.tw",
    辦公室: "鼓山區興宗里鼓山二路71號",
    黨籍: "無黨籍",
    經歷: "新任里長",
  },
  {
    區別: "鼓山區",
    里別: "光化里",
    里長姓名: "周國城",
    性別: "男",
    生日: "0500620",
    辦公室電話: "075311703",
    住家電話: "075311703",
    手機: "0911585038",
    信箱: "kh02025@kcg.gov.tw",
    辦公室: "鼓山區光化里鼓山二路25巷26弄23號",
    黨籍: "無黨籍",
    經歷: "改制後第7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "山下里",
    里長姓名: "蔡連成",
    性別: "男",
    生日: "0351126",
    辦公室電話: "075318577",
    住家電話: "075213565",
    手機: "0911638279",
    信箱: "kh02026@kcg.gov.tw",
    辦公室: "鼓山區山下里鼓山一路127巷4之1號",
    黨籍: "中國國民黨",
    經歷: "改制後第3~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "河邊里",
    里長姓名: "曾茂信",
    性別: "男",
    生日: "0330510",
    辦公室電話: "075216667",
    住家電話: "075216667",
    手機: "0932892280",
    信箱: "kh02027@kcg.gov.tw",
    辦公室: "鼓山區河邊里河邊街33號",
    黨籍: "中國國民黨",
    經歷: "改制後第4~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "綠川里",
    里長姓名: "陳春時",
    性別: "男",
    生日: "0450109",
    辦公室電話: "075318580",
    住家電話: "075318580",
    手機: "0928396119",
    信箱: "kh02028@kcg.gov.tw",
    辦公室: "鼓山區綠川里河川街89號",
    黨籍: "民主進步黨",
    經歷: "改制後第7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "登山里",
    里長姓名: "許永堃",
    性別: "男",
    生日: "0430514",
    辦公室電話: "075315357",
    住家電話: "075315344",
    手機: "0937629300",
    信箱: "kh02029@kcg.gov.tw",
    辦公室: "鼓山區登山里鼓山一路87號",
    黨籍: "無黨籍",
    經歷: "改制後第5~7屆,合併後第1屆,第2屆",
  },
  {
    區別: "鼓山區",
    里別: "峰南里",
    里長姓名: "王宋金花",
    性別: "女",
    黨籍: "無黨籍",
    生日: "0430129",
  },
];

console.log(chief.length);

let DDP = 0;
let KTM = 0;
let no = 0;
let other = 0;

// let party = {
//   DDP: 0,
//   KTM: 0,
//   no: 0,
//   other: 0,
// };

chief.forEach(function (item) {
  if (item.黨籍 === "民主進步黨") {
    DDP++;
  } else if (item.黨籍 === "中國國民黨") {
    KTM++;
  } else if (item["黨籍"] === "無黨籍") {
    no++;
  } else if (item["黨籍"] === "其他") {
    other++;
  }
});

console.log(DDP);
console.log(KTM);
console.log(no);
console.log(other);
