/*
===================================================================
!!!!! 1.情境：Jane 在她的房間裡睡覺，但她還沒睡醒，請用變數描述以下狀態 !!!!!
===================================================================
*/

/* 
======================================================================
1-1.請宣告一個 const 變數名稱為 janeOld，並賦予值為 14
1-2.請宣告一個 const 變數名稱為 janePhoneNumber，並賦予值為字串，"0955713484"
1-3.請宣告一個 const 變數名稱為 isWakeUp，並賦予值為 false
1-4.請用 console.log(janeOld,janePhoneNumber,isWakeUp )
=======================================================================
*/

const janeOld = 14;
const janePhoneNumber = "0955713484";
const isWakeUp = false;
console.log(janeOld, janePhoneNumber, isWakeUp);

/*
================================================================================
!!!!! 2.情境：小明手上有 200 元，他母親請他去飯館買飯，請觀看此圖片連結來完成此項目題目 !!!!!
================================================================================
*/

/* 
=====================================
2-1.請修改以下中文變數名稱，讓他符合變數語意
=====================================
*/

const steak = 50;
const fish = 30;
const rice = 10;
let walletTotal = 200;
console.log(steak, fish, rice);

/*
===========================================================================================
!!!!! 3.情境：承上題，母親要小明買飯，但要符合下面三個條件，並將花錢的總數計算在 cost 變數上，一起幫幫他吧！ !!!!!
===========================================================================================
*/

/* 
=======================
2-1. 一定要買白飯 2 碗以上
2-2. 母親想要吃到牛排
2-3. 一定要花 150 元以上
======================
*/

let cost = 0;
cost = rice * 3 + steak * 2 + fish * 2;
console.log(`小明買完飯了，他一共剩下${walletTotal - cost}元`);

/*
===============================================================================
!!!!! 4.情境：小華在馬路上看到許多路況，請描述他所看到的一切，並宣告變數與對應賦予的值 !!!!!
===============================================================================
*/

/* 
======================================================================
4-1. 小華在等紅綠燈，他抬頭看了下現在是紅燈，並還差 35 秒（最多三個宣告）
4-2. 目前馬路上有 10 個人
4-3. 小華太無聊看天空發呆，看到天空有三朵白雲、一顆太陽
=======================================================================
*/

// 4-1
let trafficLight = 1;
let lightStatus = "red";
let seconds = 35;

// 4-2
let pedestrians = 10;

// 4-3
let clouds = 3;
const sun = 1;

/*
=========================================================================================
!!!!! 5.情境：圖片連結為六角學院的其中一個作業任務，請依照您看到的內容來嘗試設計變數與值（至少三個）!!!!!
=========================================================================================
*/

let title = "【最終試煉】使用 jQuery 打造互動性網頁動畫效果";
let score = "50積分";
let watchNum = 62;

console.log(title, score, watchNum);

/*
=================================================================================
!!!!! 6.情境：請依照以下程式碼告知答案是多少，並在下方用註解方式寫上這五行程式碼做了什麼事!!!!!
=================================================================================
*/

let a = 1; // 範例：宣告了第一個 a 的變數，並賦予了一個 1 的數字型別
let b = 0;
a = 3;
a = b + 2;
a - b;
b += 1;

// a=2 b=1

/*
==============================================================================
!!!!! 7.情境：請依照程式碼告知答案是多少，並在下方用註解方式寫上這五行程式碼做了什麼事!!!!!
==============================================================================
*/

let arr1 = [1, 2, 3];
let arr2 = arr1;

arr2.push(4);
arr2 = [5, 6, 7];
console.log(arr1, arr2);

// arr1 = [1,2,3,4]
// arr2 = [5,6,7]

/*
===================================
!!!!! 8.情境：mary 有 20 顆蘋果 !!!!!
===================================
*/

// 他早上吃了 5 顆
// 中午吃了 12 顆
// 下午他又去買了 4 顆
// 那麼她還剩下幾顆蘋果？
// 以下的 Code 只寫到一半，還請幫幫 Mary

let maryAppleNum = 20;
maryAppleNum -= 5;
maryAppleNum -= 12;
maryAppleNum += 4;

console.log(`Mary 還有 ${maryAppleNum} 顆蘋果`);

/*
===========================================================================================
!!!!! 9.Nick 在餐廳吃飯，吃飽後想算自己的帳單多少錢，但發現帳單沒有加總金額，於是他打算透過 JS 來計算 !!!
===========================================================================================
*/

// 9-1. Nick 數學不好，所以帳單(bill)先從零開始計算
// 9-2. 一個漢堡 30 元
// 9-3. 他吃了 3 顆漢堡
// 9-4. 他將漢堡數量 * 漢堡價格算出 90 元
// 9-4. 一杯奶茶 15 元
// 9-5. 他喝了 32 杯奶茶
// 9-6. 他將奶茶數量 * 奶茶價格算出 ??? 元
// 9-6. console.log 顯示帳單

let bill = 0;
const hamburgerPrice = 30;
const milkteaPrice = 15;
bill = hamburgerPrice * 3 + milkteaPrice * 32;

console.log(`Nick 的帳單總共 ${bill} 元`);

/*
======================
!!!!! 10.型別查詢 !!!!!
======================
*/

let g = "hello";
let h = 123;
let i = g + h;
let j = true;
let k = h + h;
let l = j + k;

// 請從以下新增註解，告知上面每行分別是哪些型別
//g 是字串
//h 是數字
//i 是字串
//j 是布林值
//k 是數字
//l 是數字
