/*
=================================================================
!!!!! 情境：Jane 在她的房間裡睡覺，但她還沒睡醒，請用變數描述以下狀態 !!!!!
=================================================================
*/

/* 
======================================================================
1-1.請宣告一個 const 變數名稱為 janeOld，並賦予值為 14
1-2.請宣告一個 const 變數名稱為 janePhoneNumber，並賦予值為字串，"0955713484"
1-3.請宣告一個 const 變數名稱為 isWakeUp，並賦予值為 false
1-4.請用 console.log(janeOld,janePhoneNumber,isWakeUp )
=======================================================================
*/

const janeOld = 14;
const janePhoneNumber = "0955713484";
const isWakeUp = false;
console.log(janeOld, janePhoneNumber, isWakeUp);

/*
===============================================================================
!!!!! 情境：小明手上有 200 元，他母親請他去飯館買飯，請觀看此圖片連結來完成此項目題目 !!!!!
===============================================================================
*/

/* 
======================================================================
2-1.請修改以下中文變數名稱，讓他符合變數語意
=======================================================================
*/

const steak = 50;
const fish = 30;
const rice = 10;
let walletTotal = 200;
console.log(steak, fish, rice);

/*
================================================================================================
!!!!! 情境：承上題，母親要小明買飯，但要符合下面三個條件，並將花錢的總數計算在 cost 變數上，一起幫幫他吧！ !!!!!
================================================================================================
*/

/* 
======================================================================
2-1. 一定要買白飯 2 碗以上
2-2. 母親想要吃到牛排
2-3. 一定要花 150 元以上
=======================================================================
*/

let cost = 0;
cost = rice * 3 + steak * 2 + fish * 2;
console.log(`小明買完飯了，他一共剩下${walletTotal - cost}元`);

/*
=============================================================================
!!!!! 情境：小華在馬路上看到許多路況，請描述他所看到的一切，並宣告變數與對應賦予的值 !!!!!
=============================================================================
*/

/* 
======================================================================
4-1. 小華在等紅綠燈，他抬頭看了下現在是紅燈，並還差 35 秒（最多三個宣告）
4-2. 目前馬路上有 10 個人
4-3. 小華太無聊看天空發呆，看到天空有三朵白雲、一顆太陽
=======================================================================
*/

// 4-1
let trafficLight = 1;
let lightStatus = "red";
let seconds = 35;

// 4-2
let pedestrians = 10;

// 4-3
let clouds = 3;
const sun = 1;

/*
=========================================================================================
!!!!! 情境：圖片連結為六角學院的其中一個作業任務，請依照您看到的內容來嘗試設計變數與值（至少三個）。!!!!!
=========================================================================================
*/

let title = "【最終試煉】使用 jQuery 打造互動性網頁動畫效果";
let score = "50積分";
let watchNum = 62;

console.log(title, score, watchNum);
